# Задайте последовательность чисел. Напишите программу, которая выведет список
# неповторяющихся элементов исходной последовательности.
# [1, 1, 2, 3, 4, 5, 5] -> [2, 3, 4]

scifra = list(map(int, input("Введите числа через пробел:\n").split()))
print(f"Исходный список: {scifra}")
new_scifra = []
[new_scifra.append(i) for i in scifra if i not in new_scifra]
print(f"Список из неповторяющихся элементов: {new_scifra}")